[Killed] Block
api/web/health/healthcheckApi.js:1:41
-const registerHealthCheckApi = (app) => {
-    app.get('/', function (req, res) {
-        res.json({
-            message: 'hooray! welcome to our api!'
-        });
-    });
-}
+const registerHealthCheckApi = (app) => {}
 
 module.exports = {

[Timeout] Block
api/web/health/healthcheckApi.js:2:38
 const registerHealthCheckApi = (app) => {
-    app.get('/', function (req, res) {
-        res.json({
-            message: 'hooray! welcome to our api!'
-        });
-    });
+    app.get('/', function (req, res) {});
 }
 

[Timeout] StringLiteral
api/web/health/healthcheckApi.js:4:22
 const registerHealthCheckApi = (app) => {
     app.get('/', function (req, res) {
         res.json({
-            message: 'hooray! welcome to our api!'
+            message: ""
         });
     });
