[Killed] Block
GitHub/strykerpoc/src/calculator.js:1:39
-function substractPositive(num1, num2){
-  if (num1 > 0){
-    return num1 - num2;
-  }
-  else {
-    return 0
-  }
-}
+function substractPositive(num1, num2){}
 
 function add(num1, num2){

[Killed] IfStatement
GitHub/strykerpoc/src/calculator.js:2:7
 function substractPositive(num1, num2){
-  if (num1 > 0){
+  if (false){
     return num1 - num2;
   }

[Killed] BinaryExpression
GitHub/strykerpoc/src/calculator.js:2:7
 function substractPositive(num1, num2){
-  if (num1 > 0){
+  if (num1 <= 0){
     return num1 - num2;
   }

[Timeout] BinaryExpression
GitHub/strykerpoc/src/calculator.js:3:12
 function substractPositive(num1, num2){
   if (num1 > 0){
-    return num1 - num2;
+    return num1 + num2;
   }
   else {

[Survived] Block
GitHub/strykerpoc/src/calculator.js:5:8
   if (num1 > 0){
     return num1 - num2;
   }
-  else {
-    return 0
-  }
+  else {}
 }
 

[Killed] Block
GitHub/strykerpoc/src/calculator.js:10:25
   }
 }
 
-function add(num1, num2){
-  if (num1 == num2){
-    return num1 + num2;
-  }
-  else if (num1 > num2){
-    return num1 + num2;
-  }
-  else {
-    return num1 + num2;
-  }
-  //return num1 + num2;
-}
+function add(num1, num2){}
 
 

[Killed] Block
GitHub/strykerpoc/src/calculator.js:11:20
 }
 
 function add(num1, num2){
-  if (num1 == num2){
-    return num1 + num2;
-  }
+  if (num1 == num2){}
   else if (num1 > num2){
     return num1 + num2;

[Survived] IfStatement
GitHub/strykerpoc/src/calculator.js:11:7
 }
 
 function add(num1, num2){
-  if (num1 == num2){
+  if (false){
     return num1 + num2;
   }

[Timeout] BinaryExpression
GitHub/strykerpoc/src/calculator.js:12:12
 
 function add(num1, num2){
   if (num1 == num2){
-    return num1 + num2;
+    return num1 - num2;
   }
   else if (num1 > num2){

[Timeout] Block
GitHub/strykerpoc/src/calculator.js:14:24
   if (num1 == num2){
     return num1 + num2;
   }
-  else if (num1 > num2){
-    return num1 + num2;
-  }
+  else if (num1 > num2){}
   else {
     return num1 + num2;

[Survived] BinaryExpression
GitHub/strykerpoc/src/calculator.js:14:12
   if (num1 == num2){
     return num1 + num2;
   }
-  else if (num1 > num2){
+  else if (num1 <= num2){
     return num1 + num2;
   }

[Survived] BinaryExpression
GitHub/strykerpoc/src/calculator.js:15:12
     return num1 + num2;
   }
   else if (num1 > num2){
-    return num1 + num2;
+    return num1 - num2;
   }
   else {

[Timeout] Block
GitHub/strykerpoc/src/calculator.js:17:8
   else if (num1 > num2){
     return num1 + num2;
   }
-  else {
-    return num1 + num2;
-  }
+  else {}
   //return num1 + num2;
 }

[Survived] BinaryExpression
GitHub/strykerpoc/src/calculator.js:18:12
     return num1 + num2;
   }
   else {
-    return num1 + num2;
+    return num1 - num2;
   }
   //return num1 + num2;
