[Killed] Block
GitHub/strykerpoc/src/sum.js:1:20
-function sum(a, b) {
-  return a + b;
-}
+function sum(a, b) {}
 module.exports = sum;

[Killed] BinaryExpression
GitHub/strykerpoc/src/sum.js:2:10
 function sum(a, b) {
-  return a + b;
+  return a - b;
 }
 module.exports = sum;
